 
 
 #Область ПрограммныйИнтерфейс
 
 Процедура ЗаписатьСобытиеВЖурнал(Сообщение) Экспорт
	 
	 
	 Тестирование = БОНД_Коннектор.JsonВОбъект(Сообщение);
	 Для каждого Выборка Из Тестирование Цикл   
		 
		 job        = ПолучитьДолжность(Выборка["job"]); 
		 department = ПолучитьОтдел(Выборка["department"]); 
		 objtabnum  = Выборка["objtabnum"]; 
		 point      = ПолучитьPoint(Выборка["point"]);  
		 Если Выборка["direction"] = "Вход" Тогда
		     direction = Перечисления.НаправленияПрохода.Вход;
		 ИначеЕсли Выборка["direction"] = "Выход" тогда	
		     direction = Перечисления.НаправленияПрохода.Выход; 
		 КонецЕсли;		 
		 
		 Структура  = Новый Структура; 
		 Структура.Вставить("department", department);
		 Структура.Вставить("job",        job); 
		 Структура.Вставить("number",     Выборка["number"]);
		 Структура.Вставить("direction",  direction);
		 Структура.Вставить("point",      point);
		 Структура.Вставить("objtabnum",  objtabnum);
		 Структура.Вставить("date",       Выборка["date"]);
		 Структура.Вставить("time",       Выборка["time"]);  
		 Структура.Вставить("object",     ПолучитьObject(Выборка["object"], ,job, department, objtabnum));
		 
		 ЗаписьВЖурнал(Структура);
		 
	 КонецЦикла;  
	 
 КонецПроцедуры	
 
 Функция ПолучитьPoint(point) 
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ТочкиДоступа.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.ТочкиДоступа КАК ТочкиДоступа
	 |ГДЕ
	 |	ТочкиДоступа.Наименование ПОДОБНО &Наименование";
	 Запрос.УстановитьПараметр("Наименование", "%"+point+"%");  
	 РезультатЗапроса = Запрос.Выполнить();
	 Если Не РезультатЗапроса.Пустой() Тогда 
		 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		 ВыборкаДетальныеЗаписи.Следующий();  
		 PointUse = ВыборкаДетальныеЗаписи.Ссылка;  
	 Иначе 
		 PointUse = Справочники.ТочкиДоступа.СоздатьЭлемент();
		 PointUse.Наименование   = point; 
		 PointUse.ОбменДанными.Загрузка = Истина;
		 PointUse.Записать();
	 КонецЕсли;
	 
	 Возврат  PointUse;
	 
 КонецФункции    
 
 Функция ПолучитьObject(object, objphonenumber= Неопределено, job, department, objtabnum) 
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |  ОбъектыДоступа.Ссылка КАК Ссылка
	 |ИЗ
	 |  Справочник.ОбъектыДоступа КАК ОбъектыДоступа
	 |ГДЕ
	 |  ОбъектыДоступа.Наименование ПОДОБНО &Наименование";
	 Запрос.УстановитьПараметр("Наименование", "%"+object+"%");  
	 РезультатЗапроса = Запрос.Выполнить();
	 Если Не РезультатЗапроса.Пустой() Тогда 
		 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		 ВыборкаДетальныеЗаписи.Следующий();  
		 ОбъектДоступа = ВыборкаДетальныеЗаписи.Ссылка;  
	 Иначе 
		 ОбъектДоступа = Справочники.ОбъектыДоступа.СоздатьЭлемент();
		 ОбъектДоступа.Наименование   = object; 
		 ОбъектДоступа.Телефон        = objphonenumber;
		 ОбъектДоступа.Должность      = job;
		 ОбъектДоступа.Отдел          = department;
		 ОбъектДоступа.ТабельныйНомер = objtabnum;  
		 ОбъектДоступа.ОбменДанными.Загрузка = Истина;
		 ОбъектДоступа.Записать();
	 КонецЕсли;
	 
	 Возврат  ОбъектДоступа;
	 
 КонецФункции    
 
 Функция ПолучитьДолжность(job)
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |   Должность.Ссылка КАК Ссылка
	 |ИЗ
	 |   Справочник.Должность КАК Должность
	 |ГДЕ
	 |   Должность.Наименование ПОДОБНО &Наименование";
	 
	 Запрос.УстановитьПараметр("Наименование", job+"%");
	 РезультатЗапроса = Запрос.Выполнить(); 
	 Если Не РезультатЗапроса.Пустой() Тогда    
		 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		 ВыборкаДетальныеЗаписи.Следующий(); 
		 Должность = ВыборкаДетальныеЗаписи.Ссылка;    
	 Иначе 
		 Должность = Справочники.Должность.СоздатьЭлемент();
		 Должность.Наименование = job;
		 Должность.Записать();  
	 КонецЕсли; 
	 
	 Возврат Должность;
	 
 КонецФункции // ()
 
 Функция ПолучитьОтдел(department)
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ТочкиДоступа.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.ТочкиДоступа КАК ТочкиДоступа
	 |ГДЕ
	 |	ТочкиДоступа.Наименование ПОДОБНО &Наименование";
	 Запрос.УстановитьПараметр("Наименование", "%"+department+"%");   
	 РезультатЗапроса = Запрос.Выполнить();
	 Если Не РезультатЗапроса.Пустой() Тогда 
		 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		 ВыборкаДетальныеЗаписи.Следующий();  
		 ТочкаДоступа = ВыборкаДетальныеЗаписи.Ссылка; 
	 Иначе 
		 ТочкаДоступа = Справочники.ТочкиДоступа.СоздатьЭлемент();
		 ТочкаДоступа.Наименование = department;
		 ТочкаДоступа.Записать();
	 КонецЕсли; 
	 
	 Возврат ТочкаДоступа;
	 
 КонецФункции // ()
 
 Процедура ЗаписьВЖурнал(Структура)
     
     Движения = РегистрыСведений.ЖурналСобытий.СоздатьМенеджерЗаписи();
     ГЧС = Новый ГенераторСлучайныхЧисел();
     Движения.Период                             = ТекущаяДатаСеанса() + ГЧС.СлучайноеЧисло(1,1000000);  //служебный
     
     Движения.ДатаСобытия                       = СтроковыеФункцииКлиентСервер.СтрокаВДату(Структура.date);
     Движения.ОбъектДоступа                     = Структура.object;
     Движения.ТочкаДоступа                      = Структура.point;
     Движения.Направление                       = Структура.direction;
     Движения.ГосНомера                         = Структура.number;
     Движения.ВремяСобытия                      = СтроковыеФункцииКлиентСервер.СтрокаВДату(Структура.time,ЧастиДаты.Время);
     
     Движения.Записать(Ложь); 
     
 КонецПроцедуры
 
 #КонецОбласти   
 
 
 
 
 
 
 
 
 