 #Область СлужебныеПроцедурыИФункции 
 
 Процедура ОбработкаНовыхСообщений()Экспорт      
     
     Запрос = Новый Запрос;
     Запрос.Текст = 
     "ВЫБРАТЬ
     |  ОчередьСообщений.ЗаписанВЖурнал КАК ЗаписанВЖурнал,
     |  ОчередьСообщений.Сообщение КАК Сообщение
     |ИЗ
     |  РегистрСведений.ОчередьСообщений КАК ОчередьСообщений
     |ГДЕ
     |  ОчередьСообщений.ЗаписанВЖурнал <> ИСТИНА";
     РезультатЗапроса = Запрос.Выполнить();
     ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
     Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
         РегистрыСведений.ЖурналСобытий.ЗаписатьСобытиеВЖурнал(ВыборкаДетальныеЗаписи.Сообщение);  
         Набор = РегистрыСведений.ОчередьСообщений.СоздатьНаборЗаписей(); 
         Набор.Отбор.Сообщение.Установить(ВыборкаДетальныеЗаписи.Сообщение); 
         
         Набор.Прочитать();
         Если Набор.Количество() <> 0 Тогда
             Для Каждого стрНабора из Набор Цикл
                 стрНабора.ЗаписанВЖурнал = Истина;
             КонецЦикла;
             Набор.Записать();
         КонецЕсли;
         
     КонецЦикла;
     
 КонецПроцедуры
 
 #КонецОбласти
