 
 
 #Область ПрограммныйИнтерфейс
 
 // Процедура, записывает событие в журнал.
 //
 Процедура ЗаписатьОчередьСообщений(Сообщение) Экспорт   
 
     Движения = РегистрыСведений.ОчередьСообщений.СоздатьМенеджерЗаписи();
     ГЧС = Новый ГенераторСлучайныхЧисел();
     Движения.Период                    = ТекущаяДатаСеанса() + ГЧС.СлучайноеЧисло(1,1000000);
     Движения.ЗаписанВЖурнал            = Ложь;
     Движения.Сообщение                 = Сообщение;       
     Движения.Записать(Ложь);
     
 КонецПроцедуры
 
 #КонецОбласти