 #Область ПрограммныйИнтерфейс
 
 Процедура ЗаписьДанных(Объект, Движения)Экспорт 
	 
	 Отдел = Объект.Отдел; 
	 Дата  = Объект.Дата; 
	 Движения.ДанныеПоНарушители.Записывать = Истина;
	 Для Каждого ТекСтрокаТабличнаяЧасть Из Объект.ТабличнаяЧасть Цикл
		 Движение = Движения.ДанныеПоНарушители.Добавить();
		 Движение.Период      = Дата;
		 Движение.Отдел       = Отдел;
		 Движение.Объект      = ТекСтрокаТабличнаяЧасть.Объект;
		 Движение.Направление = ТекСтрокаТабличнаяЧасть.Направление;
	 КонецЦикла;   
	 
 КонецПроцедуры
 
 #КонецОбласти
 
 